meeting/minutes/2025/05-13.org
:PROPERTIES:
:ID:       577A5646-68E7-40CB-B5B6-5ACDF7AD04F0
:end:
#+title: QT4 CG Meeting 121 Minutes 2025-05-13
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Meeting index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

#+TOC: headlines 6

* Draft Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

* Summary of new and continuing actions [0/7]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal
+ [ ] QT4CG-112-01: JLO to propose a concrete example that uses “.” in a ~%method~s.
+ [ ] QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
+ [ ] QT4CG-118-01: MK to make an incorrect type raise an error in #1906
+ [ ] QT4CG-119-02: MK to add a note about how schema composition is done for multiple options
+ [ ] QT4CG-021-01: MK to raise a new issue which may propose a subset of the QNameLiteral which doesn't permit a namespace.
+ [ ] QT4CG-121-02: MK to fix removal of default values in the options for fn:serialize()

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [8/12]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: BTW, NW

+ [X] David J Birnbaum (DB)
+ [ ] Reece Dunn (RD)
+ [X] Christian Gr¸n (CG)
+ [X] Joel Kalvesmaki (JK)
+ [X] Michael Kay (MK), Chair.
+ [X] Juri Leino (JLO)
+ [X] John Lumley (JWL), Scribe.
+ [X] Dimitre Novatchev (DN)
+ [X] Wendell Piez (WP)
+ [ ] Ed Porter (EP)
+ [ ] Bethan Tovey-Walsh (BTW)
+ [ ] Norm Tovey-Walsh (NW) 

(NW thanks MK and JWL. This edition of the published minutes is the work of JWL lightly
edited by NW.)

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2025/05-13.html][the agenda]].

Accepted.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2025/05-06.html][the minutes of the previous meeting]], as amended.

Accepted.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting is scheduled for 20 May 2025.

No regrets heard.

** Review of open action items [1/6]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal
+ [X] QT4CG-107-05: JLO and DN to consider a proposal for system defined records.
+ [ ] QT4CG-112-01: JLO to propose a concrete example that uses “.” in a ~%method~s.
+ [ ] QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
+ [ ] QT4CG-118-01: MK to make an incorrect type raise an error in #1906
+ [ ] QT4CG-119-02: MK to add a note about how schema composition is done for multiple options

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-1942][#1942]]: 37 Support sequence, array, and map destructuring declarations
+ PR [[https://qt4cg.org/dashboard/#pr-1883][#1883]]: 882 Replace fn:chain by fn:compose
+ PR [[https://qt4cg.org/dashboard/#pr-1283][#1283]]: 77b Update expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis revised proposal for fn:ranks

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1988][#1988]]: 1986 Drop obsolete notes on error reporting

Proposal: merge without discussion.

Accepted.

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1991][#1991]]: 835 Add built-in named record types to static context
+ PR [[https://qt4cg.org/dashboard/#pr-1990][#1990]]: Update schema-for-xslt40.xsd
+ PR [[https://qt4cg.org/dashboard/#pr-1989][#1989]]: 1983 QName literals in node constructors
+ PR [[https://qt4cg.org/dashboard/#pr-1987][#1987]]: 1985 Tidy up namespace terminology
+ PR [[https://qt4cg.org/dashboard/#pr-1984][#1984]]: 882 Drop fn:chain
+ PR [[https://qt4cg.org/dashboard/#pr-1982][#1982]]: 1981 Ambiguity with qname literals and pragmas
+ PR [[https://qt4cg.org/dashboard/#pr-1977][#1977]]: 1889 Tidy up handling of HTML serialization version, default to HTML5
+ PR [[https://qt4cg.org/dashboard/#pr-1959][#1959]]: 1953 (part) XSLT Worked example using methods to implement atomic sets
+ PR [[https://qt4cg.org/dashboard/#pr-1894][#1894]]: Additional examples to fn:chain - in a new branch
+ PR [[https://qt4cg.org/dashboard/#pr-1888][#1888]]: 366 xsl:package-location

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Review of pull requests
:PROPERTIES:
:CUSTOM_ID: technical-prs
:END:

*** PR #1989: 1983 QName literals in node constructors
:PROPERTIES:
:CUSTOM_ID: pr-1989
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1989][#1989]]

Appropriate for XQuery and with a backwards incompatibility. 
Removes the option of using a string literal, replacing with QName literal.
Uses a forward reference to PR1987 on namespace defaults.

+ MK: What is unresolved is what we do for PI or namespace constructors 
  + which currently are a string literal. 
  + We could allow a Qname but error if it is in a namespace.

ACTION: QT4CG-021-01: MK to raise a new issue which may propose a subset of the QNameLiteral which doesn't permit a namespace.

+ JLO:  I like the proposal - avoiding the unreserved name string. Undecided on the processing
+ WP: I think it's about the error message that come 

Proposal: accept this PR.

Accepted.

*** PR #1982: 1981 Ambiguity with qname literals and pragmas
:PROPERTIES:
:CUSTOM_ID: pr-1982
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1982][#1982]]

+ MK: An incompatibility which now requires whitespace between # and pragma, but forbids it in a QNameLiteral.
+ JWL: Is pragma the least disruptive?
+ MK: Yes and most people using pragmas probably have whitespace already.

Proposal: accept this PR.

Accepted.

*** PR #1977: 1889 Tidy up handling of HTML serialization version, default to HTML5
:PROPERTIES:
:CUSTOM_ID: pr-1977
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1977][#1977]]

+ MK: Clarifying the rules and moving the default to HTML5 and de-emphasising earlier conventions.
  + We no longer give (global) default values for (most of?) the serialisation
    parameters.
  + XML version default is 1.0, HTML is 5
+ CG: Questions on the PR may have already been answered. We need to look at the defaults for fn:serialize()

ACTION: QT4CG-121-02: MK to fix removal of default values in the options for fn:serialize()

Proposal: accept the PR with the above action.

Accepted.

*** PR #1987: 1985 Tidy up namespace terminology
:PROPERTIES:
:CUSTOM_ID: pr-1987
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1987][#1987]]

+ MK: Now with a set of defined term named rules, (E.g. default type namespace
  rule...) which are then referenced for use cases.

Proposal: accept this PR

Accepted.

*** PR #1990: Update schema-for-xslt40.xsd
:PROPERTIES:
:CUSTOM_ID: pr-1990
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1990][#1990]]

+ MK: Detailed work by Priscilla Walmsley.

MK has checked the detail, with only a few minor errors.

+ JK: Is there a test suite?
+ MK: yes - there are a set of tests of various forms.
+ JK: can we add new tests to check for the new material?
+ MK: the schema for XSLT is not normative.

Some discussion on the relation between spec and schema

Proposal: accept this PR

Accepted with thanks to Priscilla!

*** PR #1888: 366 xsl:package-location
:PROPERTIES:
:CUSTOM_ID: pr-1888
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1888][#1888]]

+ JK: PR mostly for comments and probably not yes for acceptance.
  + … As an XSLT programmer, xsl:use-package is not like xsl:import etc, and it
    doesn't give me control of the resources from the program. This is left to
    the implementation/execution.
  + … To fix this we add a xsl:package-location element which describes the
    potential paths and types of resources.
+ JWL: Do we need unique priorities rather than order? 

Some discussion including from JLO.

+ MK: Archive-path might be confused as path within the archive. Also where do
  URI formats come from.
+ JK: is an href enough to negotiate with package services?

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.

* Adjourned
:PROPERTIES:
:CUSTOM_ID: adjourned
:END:
