meeting/minutes/2025/05-13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 121 Minutes 2025-05-13</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 121 Minutes 2025-05-13</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/7]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/12]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[1/6]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#merge-without-discussion">1.6.2. Merge without discussion</a></li>
<li><a href="#substantive">1.6.3. Substantive PRs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#technical-prs">2.1. Review of pull requests</a>
<ul>
<li><a href="#pr-1989">2.1.1. PR #1989: 1983 QName literals in node constructors</a></li>
<li><a href="#pr-1982">2.1.2. PR #1982: 1981 Ambiguity with qname literals and pragmas</a></li>
<li><a href="#pr-1977">2.1.3. PR #1977: 1889 Tidy up handling of HTML serialization version, default to HTML5</a></li>
<li><a href="#pr-1987">2.1.4. PR #1987: 1985 Tidy up namespace terminology</a></li>
<li><a href="#pr-1990">2.1.5. PR #1990: Update schema-for-xslt40.xsd</a></li>
<li><a href="#pr-1888">2.1.6. PR #1888: 366 xsl:package-location</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
<li><a href="#adjourned">4. Adjourned</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="../2025/05-20.html">at meeting 122</a> on 20 May 2025.
</p>
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/7]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-112-01: JLO to propose a concrete example that uses “.” in a ~%method~s.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-118-01: MK to make an incorrect type raise an error in #1906</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-119-02: MK to add a note about how schema composition is done for multiple options</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-021-01: MK to raise a new issue which may propose a subset of the QNameLiteral which doesn't permit a namespace.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-121-02: MK to fix removal of default values in the options for fn:serialize()</li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/12]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: BTW, NW
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="off"><code>[&#xa0;]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Gr¸n (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK), Chair.</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="on"><code>[X]</code> John Lumley (JWL), Scribe.</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="off"><code>[&#xa0;]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="off"><code>[&#xa0;]</code> Norm Tovey-Walsh (NW)</li>
</ul>

<p>
(NW thanks MK and JWL. This edition of the published minutes is the work of JWL lightly
edited by NW.)
</p>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2025/05-13.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2025/05-06.html">the minutes of the previous meeting</a>, as amended.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is scheduled for 20 May 2025.
</p>

<p>
No regrets heard.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/6]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal</li>
<li class="on"><code>[X]</code> QT4CG-107-05: JLO and DN to consider a proposal for system defined records.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-112-01: JLO to propose a concrete example that uses “.” in a ~%method~s.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-118-01: MK to make an incorrect type raise an error in #1906</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-119-02: MK to add a note about how schema composition is done for multiple options</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1942">#1942</a>: 37 Support sequence, array, and map destructuring declarations</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1883">#1883</a>: 882 Replace fn:chain by fn:compose</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1283">#1283</a>: 77b Update expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis revised proposal for fn:ranks</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1988">#1988</a>: 1986 Drop obsolete notes on error reporting</li>
</ul>

<p>
Proposal: merge without discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1991">#1991</a>: 835 Add built-in named record types to static context</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1990">#1990</a>: Update schema-for-xslt40.xsd</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1989">#1989</a>: 1983 QName literals in node constructors</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1987">#1987</a>: 1985 Tidy up namespace terminology</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1984">#1984</a>: 882 Drop fn:chain</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1982">#1982</a>: 1981 Ambiguity with qname literals and pragmas</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1977">#1977</a>: 1889 Tidy up handling of HTML serialization version, default to HTML5</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1959">#1959</a>: 1953 (part) XSLT Worked example using methods to implement atomic sets</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1894">#1894</a>: Additional examples to fn:chain - in a new branch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1888">#1888</a>: 366 xsl:package-location</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-technical-prs" class="outline-3">
<h3 id="technical-prs"><span class="section-number-3">2.1.</span> Review of pull requests</h3>
<div class="outline-text-3" id="text-technical-prs">
</div>

<div id="outline-container-pr-1989" class="outline-4">
<h4 id="pr-1989"><span class="section-number-4">2.1.1.</span> PR #1989: 1983 QName literals in node constructors</h4>
<div class="outline-text-4" id="text-pr-1989">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1989">#1989</a>
</p>

<p>
Appropriate for XQuery and with a backwards incompatibility. 
Removes the option of using a string literal, replacing with QName literal.
Uses a forward reference to PR1987 on namespace defaults.
</p>

<ul class="org-ul">
<li>MK: What is unresolved is what we do for PI or namespace constructors 
<ul class="org-ul">
<li>which currently are a string literal.</li>
<li>We could allow a Qname but error if it is in a namespace.</li>
</ul></li>
</ul>

<p>
ACTION: QT4CG-021-01: MK to raise a new issue which may propose a subset of the QNameLiteral which doesn't permit a namespace.
</p>

<ul class="org-ul">
<li>JLO:  I like the proposal - avoiding the unreserved name string. Undecided on the processing</li>
<li>WP: I think it's about the error message that come</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-1982" class="outline-4">
<h4 id="pr-1982"><span class="section-number-4">2.1.2.</span> PR #1982: 1981 Ambiguity with qname literals and pragmas</h4>
<div class="outline-text-4" id="text-pr-1982">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1982">#1982</a>
</p>

<ul class="org-ul">
<li>MK: An incompatibility which now requires whitespace between # and pragma, but forbids it in a QNameLiteral.</li>
<li>JWL: Is pragma the least disruptive?</li>
<li>MK: Yes and most people using pragmas probably have whitespace already.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-1977" class="outline-4">
<h4 id="pr-1977"><span class="section-number-4">2.1.3.</span> PR #1977: 1889 Tidy up handling of HTML serialization version, default to HTML5</h4>
<div class="outline-text-4" id="text-pr-1977">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1977">#1977</a>
</p>

<ul class="org-ul">
<li>MK: Clarifying the rules and moving the default to HTML5 and de-emphasising earlier conventions.
<ul class="org-ul">
<li>We no longer give (global) default values for (most of?) the serialisation
parameters.</li>
<li>XML version default is 1.0, HTML is 5</li>
</ul></li>
<li>CG: Questions on the PR may have already been answered. We need to look at the defaults for fn:serialize()</li>
</ul>

<p>
ACTION: QT4CG-121-02: MK to fix removal of default values in the options for fn:serialize()
</p>

<p>
Proposal: accept the PR with the above action.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-1987" class="outline-4">
<h4 id="pr-1987"><span class="section-number-4">2.1.4.</span> PR #1987: 1985 Tidy up namespace terminology</h4>
<div class="outline-text-4" id="text-pr-1987">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1987">#1987</a>
</p>

<ul class="org-ul">
<li>MK: Now with a set of defined term named rules, (E.g. default type namespace
rule&#x2026;) which are then referenced for use cases.</li>
</ul>

<p>
Proposal: accept this PR
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-1990" class="outline-4">
<h4 id="pr-1990"><span class="section-number-4">2.1.5.</span> PR #1990: Update schema-for-xslt40.xsd</h4>
<div class="outline-text-4" id="text-pr-1990">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1990">#1990</a>
</p>

<ul class="org-ul">
<li>MK: Detailed work by Priscilla Walmsley.</li>
</ul>

<p>
MK has checked the detail, with only a few minor errors.
</p>

<ul class="org-ul">
<li>JK: Is there a test suite?</li>
<li>MK: yes - there are a set of tests of various forms.</li>
<li>JK: can we add new tests to check for the new material?</li>
<li>MK: the schema for XSLT is not normative.</li>
</ul>

<p>
Some discussion on the relation between spec and schema
</p>

<p>
Proposal: accept this PR
</p>

<p>
Accepted with thanks to Priscilla!
</p>
</div>
</div>

<div id="outline-container-pr-1888" class="outline-4">
<h4 id="pr-1888"><span class="section-number-4">2.1.6.</span> PR #1888: 366 xsl:package-location</h4>
<div class="outline-text-4" id="text-pr-1888">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1888">#1888</a>
</p>

<ul class="org-ul">
<li>JK: PR mostly for comments and probably not yes for acceptance.
<ul class="org-ul">
<li>… As an XSLT programmer, xsl:use-package is not like xsl:import etc, and it
doesn't give me control of the resources from the program. This is left to
the implementation/execution.</li>
<li>… To fix this we add a xsl:package-location element which describes the
potential paths and types of resources.</li>
</ul></li>
<li>JWL: Do we need unique priorities rather than order?</li>
</ul>

<p>
Some discussion including from JLO.
</p>

<ul class="org-ul">
<li>MK: Archive-path might be confused as path within the archive. Also where do
URI formats come from.</li>
<li>JK: is an href enough to negotiate with package services?</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>

<div id="outline-container-adjourned" class="outline-2">
<h2 id="adjourned"><span class="section-number-2">4.</span> Adjourned</h2>
<div class="outline-text-2" id="text-adjourned">
</div>
</div>
</div>
</body>
</html>
